STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
#define DEMO_MAX_COMMAND  (9u + DEMO_COMMAND_VDM + DEMO_COMMAND_PD30)

/* Private variables ---------------------------------------------------------*/
const typedef_COMMANDE g_tab_command_global[DEMO_MAX_COMMAND] = {
  { COMMAND_HARDRESET                   ,"HARD RESET            ", COMMANDROLE_SRC | COMMANDROLE_SNK  },
  { COMMAND_CONTROLMSG_GOTOMIN          ,"GOTO MIN              ", COMMANDROLE_SRC },
  { COMMAND_CONTROLMSG_GET_SRC_CAP      ,"GET SOURCE CAPA       ", COMMANDROLE_SRC | COMMANDROLE_DRP  },
  { COMMAND_CONTROLMSG_GET_SNK_CAP      ,"GET SINK   CAPA       ", COMMANDROLE_SRC },
  { COMMAND_CONTROLMSG_DR_SWAP          ,"DATA ROLE SWAP        ", COMMANDROLE_SRC | COMMANDROLE_SNK  },
  { COMMAND_CONTROLMSG_PR_SWAP          ,"POWER ROLE SWAP       ", COMMANDROLE_DRP },
  { COMMAND_CONTROLMSG_VCONN_SWAP       ,"VCONN SWAP            ", COMMANDROLE_VCONN },
  { COMMAND_CONTROLMSG_SOFT_RESET       ,"SOFT RESET            ", COMMANDROLE_SRC | COMMANDROLE_SNK },
#if defined(_VDM)
  { COMMAND_REQUEST_VDM_DISCOVERY       ,"REQUEST VDM DISCOVERY " ,COMMANDROLE_SRC | COMMANDROLE_SNK },
#endif
#if defined(USBPD_REV30_SUPPORT)
  { COMMAND_CONTROLMSG_GET_SRC_CAPEXT   ,"GET SOURCE EXT CAPA   ", COMMANDROLE_SNK },
  { COMMAND_CONTROLMSG_GET_STATUS       ,"GET_STATUS            ", 0               },
  { COMMAND_CONTROLMSG_GET_SNK_CAPEXT   ,"GET SINK EXT CAPA     ", COMMANDROLE_SRC },
#endif /* USBPD_REV30_SUPPORT */
  { COMMAND_NONE                        ,""                      , 0}
};

const DEMO_MENU g_tab_menu_next[2][MENU_MAX] = {
  { MENU_EMPTY,  MENU_SOURCECAPA_RECEIVED, MENU_SINKCAPA_RECEIVED, MENU_EXTCAPA_RECEIVED, MENU_SNKEXTCAPA_RECEIVED, MENU_CABLE, MENU_COMMAND, MENU_BUILD },
  { MENU_EMPTY,  MENU_SOURCECAPA_RECEIVED, MENU_EXTCAPA_RECEIVED,  MENU_EMPTY,            MENU_BUILD,               MENU_EMPTY, MENU_COMMAND, MENU_EMPTY }
};

const DEMO_MENU g_tab_menu_prev[2][MENU_MAX] = {
  { MENU_EMPTY, MENU_CABLE, MENU_COMMAND, MENU_SOURCECAPA_RECEIVED, MENU_SINKCAPA_RECEIVED,   MENU_EXTCAPA_RECEIVED,  MENU_COMMAND,           MENU_SNKEXTCAPA_RECEIVED },
  { MENU_EMPTY, MENU_BUILD, MENU_COMMAND, MENU_EMPTY,               MENU_SOURCECAPA_RECEIVED, MENU_EMPTY,             MENU_EXTCAPA_RECEIVED,  MENU_EMPTY }
};

static typedef_COMMANDE g_tab_command_PORT[2][DEMO_MAX_COMMAND];

/*  contains the id of the selected item inside a menu*/
static uint8_t   g_tab_menu_sel[2] = { 0, 0};
/*  contains the menu selected position  */
static  int8_t   g_tab_menu_pos[2] = { 0, 0};

/* avoid multiple joystick event */
static __IO uint8_t joyevent = 0;

const uint8_t g_tab_error_strings[DEMO_ERROR_TYPE_MAXNBITEMS][DEMO_ERROR_MAX_MSG_SIZE] = {
  "  POWER SUPPLY ERROR  ",    /* Power Supply error */
  " FLASH SETTINGS ERROR ",    /* Error in settings stored in flash */
};


/* Private variables ---------------------------------------------------------*/

/* Counter for Sel Joystick pressed*/
#if defined(_RTOS)
osMessageQId  LCDMsgBox;
#if (osCMSIS >= 0x20000U)
osThreadAttr_t Demo_Thread_Atrr = {
  .name       = "LCD",
  .priority   = FREERTOS_DEMO_LCD_PRIORITY, /*osPriorityLow,*/
  .stack_size = FREERTOS_DEMO_LCD_STACK_SIZE
};
#endif /* osCMSIS >= 0x20000U */
#endif /* _RTOS */
static int8_t portSel =0;
USBPD_DiscoveryIdentity_TypeDef pIdentity;

LCD_UTILS_Drv_t lcdDrv;

/* Private function prototypes -----------------------------------------------*/
static void Display_Selected_port(void);
static void Display_border(void);
static void Display_clear_info(void);
static void Display_debug_port(uint8_t PortNum, uint8_t *msg);

static void Display_sinkcapa_menu(uint8_t PortNum);
static void Display_sinkcapa_menu_nav(uint8_t PortNum, int8_t Or);

static void Display_sourcecapa_menu_nav(uint8_t PortNum, int8_t Or);
static uint8_t  Display_sourcecapa_menu_exec(uint8_t PortNum);

static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Or);
static void     Display_sinkextcapa_menu_nav(uint8_t PortNum, int8_t Orientation);
static void Display_command_menu(uint8_t PortNum);
static void Display_command_menu_nav(uint8_t PortNum, int8_t Or);
static void Display_command_menu_exec(uint8_t PortNum);

static void Display_cableinfo_menu(uint8_t PortNum);

#if (osCMSIS < 0x20000U)
static void DEMO_Task(void const *queue_id);
#else
static void DEMO_Task(void *queue_id);
#endif
static void string_completion(uint8_t *Str, uint8_t SizeMax);

/**
  * @brief  Demo BSP initialisation
  * @retval DEMO_ErrorCode status
  */
DEMO_ErrorCode DEMO_InitBSP(void)
{
  /* Initialize the LCD driver*/
  lcdDrv.DrawBitmap  = BSP_LCD_DrawBitmap;
  lcdDrv.FillRGBRect = BSP_LCD_FillRGBRect;
  lcdDrv.DrawHLine   = BSP_LCD_DrawHLine;
  lcdDrv.DrawVLine   = BSP_LCD_DrawVLine;
  lcdDrv.FillRect    = BSP_LCD_FillRect;
  lcdDrv.GetPixel    = BSP_LCD_ReadPixel;
  lcdDrv.SetPixel    = BSP_LCD_WritePixel;
  lcdDrv.GetXSize    = BSP_LCD_GetXSize;
  lcdDrv.GetYSize    = BSP_LCD_GetYSize;
  lcdDrv.SetLayer    = BSP_LCD_SetActiveLayer;
  lcdDrv.GetFormat   = BSP_LCD_GetFormat;

  UTIL_LCD_SetFuncDriver(&lcdDrv); /* SetFunc before setting device */
  UTIL_LCD_SetDevice(DEMO_MAIN_LCD);   /* SetDevice after funcDriver is set */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);

  /* Set the display on */
  if (BSP_LCD_DisplayOn(0) != BSP_ERROR_NONE)
  {
    while(1);
  }

  /* Clear the LCD */
  UTIL_LCD_Clear(UTIL_LCD_COLOR_WHITE);

  BSP_LCD_DrawBitmap(DEMO_MAIN_LCD, 0, 0, (uint8_t *)header_data_logo);
  Display_Selected_port();
  Display_border();

  /* Initialize Joystick */
  BSP_JOY_Init(JOY1, JOY_MODE_EXTI, JOY_ALL);

  BSP_PB_Init(BUTTON_TAMPER , BUTTON_MODE_EXTI);

  return DEMO_OK;
}

/**
  * @brief  Demo Task initialisation
  * @retval DEMO_ErrorCode status
  */
DEMO_ErrorCode DEMO_InitTask()
{
#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
  osMessageQDef(MsgBox, LCD_ALARMBOX_MESSAGES_MAX, uint32_t);

  LCDMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  osThreadDef(LCD, DEMO_Task, FREERTOS_DEMO_LCD_PRIORITY, 0, FREERTOS_DEMO_LCD_STACK_SIZE);
  if(NULL == osThreadCreate(osThread(LCD), &LCDMsgBox))
#else

