STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
  UTIL_LCD_DrawLine(0, 5 * Font12.Height, 320, 5 * Font12.Height, UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_DrawLine(0, 16 * Font12.Height -1, 320, 16 * Font12.Height - 1, UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_DrawLine(160, 16 * Font12.Height - 1, 160, 240, UTIL_LCD_COLOR_ST_BLUE_DARK);
}

/**
  * @brief  Display clear info
  * @retval None
  */
static void Display_clear_info(void)
{
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetFont(&Font12);

  /* Fill a blank rectangle to clear the display information panel */
  UTIL_LCD_FillRect(0, LINE(6), 320, 9*Font12.Height, UTIL_LCD_COLOR_WHITE);
}

/**
  * @brief  Display build info
  * @retval None
  */
static void Display_build_info(void)
{
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetFont(&Font16);

  UTIL_LCD_DisplayStringAt(0, 1 + (5 * Font16.Height), (uint8_t*)"USBPD Demo for", CENTER_MODE);
  UTIL_LCD_DisplayStringAt(0, 1 + (6 * Font16.Height), (uint8_t*)"STM32L552E-EVAL", CENTER_MODE);
#if defined(_GUI_INTERFACE) && defined(_TRACE)
  UTIL_LCD_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI TRACE", CENTER_MODE);
#elif defined(_GUI_INTERFACE) && !defined(_TRACE)
  UTIL_LCD_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI", CENTER_MODE);
#elif !defined(_GUI_INTERFACE) && defined(_TRACE)
  UTIL_LCD_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"TRACE", CENTER_MODE);
#else /* TRACE */
  //UTIL_LCD_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"GUI", CENTER_MODE);
#endif
#ifdef _VDM
  UTIL_LCD_DisplayStringAt(0, 1 + (9 * Font16.Height), (uint8_t*)"VDM", CENTER_MODE);
#endif

  char tab[26] = {0};
  sprintf(tab,"FW:%6x-STACK:%8x", USBPD_FW_VERSION, _LIB_ID);
  UTIL_LCD_DisplayStringAt(0, 1 + (10 * Font16.Height), (uint8_t*)tab, CENTER_MODE);
}

/**
  * @brief  Menu selection management
  * @param  PortNum     The handle of the port
  * @param  IndexMax    MAX index
  * @param  LineMax     MAX line
  * @param  Start       Pointer on Start
  * @param  End         Pointer on end
  * @param  Orientation Orientation
  * @retval None
  */
static void Menu_manage_selection(uint8_t PortNum, uint8_t IndexMax, uint8_t LineMax, uint8_t *Start, uint8_t *End, int8_t Orientation)
{
  *Start = 0;
  *End   = *Start + LineMax;

  if(( Orientation == 0 ) || (IndexMax == 0))
  {
    *Start = 0;
    *End =(LineMax > IndexMax)? IndexMax: LineMax;
    g_tab_menu_pos[PortNum] = g_tab_menu_sel[PortNum] = 0;
    return;
  }

  if( -1 == Orientation)
  {
    if(0 == g_tab_menu_sel[PortNum])
    {
      /* got at the end of the selection */
      g_tab_menu_pos[PortNum] = LineMax > IndexMax? IndexMax-1: LineMax-1;
      g_tab_menu_sel[PortNum] = IndexMax-1;
      *End = IndexMax;
      if( IndexMax > LineMax ) {
        *Start = IndexMax - LineMax;
      } else {
        *Start = 0;
      }
    }
    else
    {
      if(0 == g_tab_menu_pos[PortNum])
      {
        g_tab_menu_sel[PortNum]--;
        *Start =  g_tab_menu_sel[PortNum];
        if(IndexMax > LineMax )
          *End = *Start + LineMax;
        else
          *End = *Start + IndexMax;
      }
      else
      {
      *Start = g_tab_menu_sel[PortNum] - g_tab_menu_pos[PortNum];
      if(IndexMax > LineMax )
        *End   = g_tab_menu_sel[PortNum] + LineMax - g_tab_menu_pos[PortNum];
      else
        *End   = g_tab_menu_sel[PortNum] + IndexMax - g_tab_menu_pos[PortNum];

      g_tab_menu_pos[PortNum]--;
      g_tab_menu_sel[PortNum]--;
      }
    }
  }
  else  /* +1 == orientation */
  {
    if(((LineMax-1) == g_tab_menu_pos[PortNum]) || (((IndexMax-1) == g_tab_menu_pos[PortNum]) && (LineMax >= IndexMax)))
    {      /* at the end of selection, so two case there is others data or at the end of the data */
      if(g_tab_menu_sel[PortNum] == (IndexMax-1))
      {
        /* restart at the begin of the list */
        g_tab_menu_pos[PortNum] = 0;
        g_tab_menu_sel[PortNum] = 0;
        *Start = 0;
        *End   = LineMax > IndexMax? IndexMax : LineMax;
      }
      else
      {
        *Start = g_tab_menu_sel[PortNum] - (LineMax-1) + 1;
        *End = *Start+LineMax;
        g_tab_menu_sel[PortNum]++;
      }
    }
    else
    {
      *Start = g_tab_menu_sel[PortNum] - g_tab_menu_pos[PortNum];
      if(IndexMax > LineMax)
        *End   = *Start + LineMax;
      else
        *End   = *Start + IndexMax;
      g_tab_menu_sel[PortNum]++;
      g_tab_menu_pos[PortNum]++;
    }
  }
}

/**
  * @brief  get next menu
  * @param  PortNum     The handle of the port
  * @param  MenuId      ID menu
  * @retval menuid
  */
static DEMO_MENU Menu_manage_next(uint8_t PortNum, uint8_t MenuId)
{
  return g_tab_menu_next[PortNum][MenuId];
}

/**
  * @brief  get prev menu
  * @param  PortNum     The handle of the port
  * @param  MenuId      ID menu
  * @param  MenuId
  * @retval menuid
  */
static DEMO_MENU Menu_manage_prev(uint8_t PortNum, uint8_t MenuId)
{
  return g_tab_menu_prev[PortNum][MenuId];
}

/**
  * @brief  cable info memu
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_cableinfo_menu(uint8_t PortNum)
{
  uint8_t str[30];
  char *ss[4]        = {"2.0","GEN1","GEN1&2","NA  "};
  char *vbusc[4]     = {"NA","3A","5A","NA"};
  char *MaxVoltage[] = {"20V  ", "30V  ", "40V  ", "50V  "};
  char *Term[]    =    {"     ", "VCONN", "VCONN", "VCONN"};
  char *Latency[]    = {"<10ns", "<20ns", "<30ns", "<40ns",
                        "<50ns", "<60ns", "<70ns", ">70ns"
                        "1000 ", "2000 "};

  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetFont(&Font16);

  /* Display menu sink capa */
  UTIL_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Cable information :", LEFT_MODE);

  if(pIdentity.CableVDO_Presence == 0)
  {
    sprintf((char *)str, "no information available");
    UTIL_LCD_DisplayStringAt(0, 1 + 8 * Font12.Height + Font16.Height , str, LEFT_MODE);
  }
  else
  {
    sprintf((char *)str, "USBSS: %s  VBUS cap:%s", ss[pIdentity.CableVDO.b.USB_SS_Support],vbusc[pIdentity.CableVDO.b.VBUS_CurrentHandCap]);
    UTIL_LCD_DisplayStringAt(0, 1 + 7 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "Max V: %s  TType:%s", MaxVoltage[pIdentity.CableVDO.b.CableMaxVoltage], Term[pIdentity.CableVDO.b.CableTermType]);
    UTIL_LCD_DisplayStringAt(0, 1 + 8 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "Laten; %s CableType:0x%x", Latency[pIdentity.CableVDO.b.CableLatency],pIdentity.CableVDO.b.CableToType);
    UTIL_LCD_DisplayStringAt(0, 1 + 9 * Font12.Height + Font16.Height , str, LEFT_MODE);
    sprintf((char *)str, "VDO:0x%x FW:0x%x  HW:0x%x", pIdentity.CableVDO.b.VDO_Version,pIdentity.CableVDO.b.CableFWVersion,pIdentity.CableVDO.b.CableHWVersion );
    UTIL_LCD_DisplayStringAt(0, 1 + 10 * Font12.Height + Font16.Height , str, LEFT_MODE);
  }
}

/**
  * @brief  snk capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_sinkcapa_menu(uint8_t PortNum)
{
  uint8_t str[32];

