STMicroelectronics/STM32CubeL5/Projects/STM32L552E-EV/Demonstrations/Modules/ucpd/demo_application.c
  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetFont(&Font16);

  /* Display menu sink capa */
  UTIL_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Sink capa :", LEFT_MODE);

  UTIL_LCD_SetFont(&Font12);
  sprintf((char *)str, "FRS  DRD  USB  EPW  HCPA  DRP ");
#if defined(USBPD_REV30_SUPPORT)
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_FRS_SUPPORT_Msk)           str[3] = '*';
#endif
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_DRD_SUPPORT_Msk)           str[8] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_USBCOMM_Msk)               str[13] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_EXT_POWER_Msk)             str[18] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_HIGHERCAPAB_Msk)           str[24] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[PortNum] & USBPD_PDO_SNK_FIXED_DRP_SUPPORT_Msk)           str[29] = '*';
  UTIL_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height + Font16.Height , str, LEFT_MODE);

  Display_sinkcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  snk capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         Navigation
  * @retval None
  */
static void Display_sinkcapa_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _str[30];
  uint8_t _max = DPM_Ports[portSel].DPM_NumberOfRcvSNKPDO;
  uint8_t _start, _end;

  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_PDO, &_start, &_end, Nav);

  for(int8_t index=_start; index < _end; index++)
  {
    switch((uint32_t)((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_TYPE_Msk) >> USBPD_PDO_TYPE_Pos))
    {
    case USBPD_CORE_PDO_TYPE_FIXED :
      {
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos)*10;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_FIXED_VOLTAGE_Msk) >> USBPD_PDO_SRC_FIXED_VOLTAGE_Pos)*50;
        sprintf((char*)_str, " FIXED:       %2luV %2lu.%luA", (unsigned long)(maxvoltage/1000), (unsigned long)(maxcurrent/1000), (unsigned long)(maxcurrent % 1000) /100);
      }
      break;
    case USBPD_CORE_PDO_TYPE_BATTERY :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxpower = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_POWER_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_POWER_Pos) * 250;
        sprintf((char*)_str, " BATT:%2lu.%1lu-%2lu.%1luV %2lu.%luW", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxpower/1000), (unsigned long)(maxpower%1000)/100);
      }
      break;
    case USBPD_CORE_PDO_TYPE_VARIABLE :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Pos) * 10;
        sprintf((char*)_str, " VAR: %2lu.%1lu-%2lu.%1luV %2lu.%luA ", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxcurrent/1000), (unsigned long)((maxcurrent % 1000) /100));
      }
      break;
#if _PPS
    case USBPD_CORE_PDO_TYPE_APDO :
      {
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Pos) * 100;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Pos) * 100;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] & USBPD_PDO_SRC_APDO_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_APDO_MAX_CURRENT_Pos) * 50;
        sprintf((char*)_str, " APDO:%2lu.%1lu-%2lu.%1luV %2lu.%luA ", (unsigned long)(minvoltage/1000), (unsigned long)(minvoltage/100)%10, (unsigned long)(maxvoltage/1000), (unsigned long)(maxvoltage/100)%10, (unsigned long)(maxcurrent/1000), (unsigned long)((maxcurrent % 1000) /100));
      }
      break;
#endif /* _PPS */
    default :
      sprintf((char*)_str,"Not yet managed by demo");
      break;
    }

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_ST_PINK);
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
    }
    string_completion(_str, sizeof(_str));
    UTIL_LCD_DisplayStringAt(0, 1 + 8 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str, CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  src capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_sourcecapa_menu(uint8_t PortNum)
{
  uint8_t str[32];

  UTIL_LCD_SetBackColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ST_BLUE_DARK);
  UTIL_LCD_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Source capa : %lu", (unsigned long)DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO);
  UTIL_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

  UTIL_LCD_SetFont(&Font12);
  sprintf((char *)str, "UNCK  DRD  USB  EPW  SUSP  DRP ");
#if defined(USBPD_REV30_SUPPORT)
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_UNCHUNK_SUPPORT_Msk)       str[4] = '*';
#endif
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_DRD_SUPPORT_Msk)           str[9] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_USBCOMM_Msk)               str[14] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_EXT_POWER_Msk)             str[19] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_USBSUSPEND_Msk)            str[25] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_DRP_SUPPORT_Msk)           str[30] = '*';
  UTIL_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height + Font16.Height , str, LEFT_MODE);

  Display_sourcecapa_menu_nav(PortNum, 0);
}

/**
  * @brief  src capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         Navigation
  * @retval None
  */
static void Display_sourcecapa_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _str[25];
  uint8_t _max = DPM_Ports[portSel].DPM_NumberOfRcvSRCPDO;
  uint8_t _start, _end;

